---
kind: other
id: Properties.T:Autodesk.Revit.DB.LinePattern
source: html/7de0474f-0e5c-3bf1-0edc-76ca008ac172.htm
---
# LinePattern Properties

Specifies whether the .NET object represents a valid Revit entity.